'''Список чисел
На вход программе подается одно число n. Напишите программу, которая выводит список [1, 2, 3, ..., n].
На вход программе подается одно натуральное число.
Программа должна вывести текст в соответствии с условием задачи.'''
# мое решение:
# n = int(input())
# print(list(range(1, n + 1)))
# решение "однострочное":
#print(list(range(1, int(input()) + 1)))
'''Список букв
На вход программе подается одно число n. Напишите программу, которая выводит список, состоящий из n букв английского 
алфавита ['a', 'b', 'c', ...] в нижнем регистре.
На вход программе подается натуральное число n,n≤26.
Программа должна вывести текст в соответствии с условием задачи.'''
# n = int(input())
# a = []
# for i in range(n):
#     a += chr(ord('a') + i)
# print(a)
# numbers1 = [1, 2, 3]
# numbers2 = [6]
# numbers3 = [7, 8, 9, 10, 11, 12, 13]
# print((numbers1 * 2) + (numbers2 * 9) + numbers3)