'''Звездный прямоугольник 1
Напишите функцию draw_box(), которая выводит звездный прямоугольник с размерами 14×10 в соответствии с образцом:
**********
*        *
*        *
*        *
*        *
*        *
*        *
*        *
*        *
*        *
*        *
*        *
*        *
**********
Примечание. Для вывода прямоугольника используйте цикл for. '''
# def draw_box():
#     print('*' * 10, sep='')
#     for _ in range(12):
#         print('*' + ' ' * 8 + '*', sep='')
#     print('*' * 10, sep='')

# draw_box()
'''Звездный треугольник 1
Напишите функцию draw_triangle(), которая выводит звездный прямоугольный треугольник с катетами, равными 10 в 
соответствии с образцом:
*
**
***
****
*****
******
*******
********
*********
**********
Примечание. Для вывода треугольника используйте цикл for.  '''
# def draw_triangle():
#     for i in range(1, 10 +1):
#         print('*' * i)
        
        
# draw_triangle()