'''Середина отрезка
Напишите функцию get_middle_point(x1, y1, x2, y2), которая принимает в качестве аргументов координаты концов отрезка 
(x1; y1) и (x2 ;y2) и возвращает координаты точки являющейся серединой данного отрезка.'''
# объявление функции
# def get_middle_point(x1, y1, x2, y2):
#     return (x1 + x2) / 2, (y1 + y2) / 2

# # считываем данные
# x_1, y_1 = int(input()), int(input())
# x_2, y_2 = int(input()), int(input())

# # вызываем функцию
# x, y = get_middle_point(x_1, y_1, x_2, y_2)
# print(x, y)

'''Площадь и длина
Напишите функцию get_circle(radius), которая принимает в качестве аргумента радиус окружности и возвращает два 
значения: длину окружности и площадь круга, ограниченного данной окружностью.'''
# from math import*
# # объявление функции
# def get_circle(radius):
#     return 2*pi*radius, pi*(radius ** 2)

# # считываем данные
# r = float(input())

# # вызываем функцию
# length, square = get_circle(r)
# print(length, square)